// show data on console and comment
// การแสดงผลข้อมูลที่ console (terminal) และ การเขียนคอมเม้นต์ห
//------------------------------
// console.log
console.log("Hello World");
console.log('Hello World');
console.log(`Hello World`); //แนะนำให้ใช้เครื่องหมาย ` (backtick) ในการแสดงข้อความ
console.log("10 + 20 = , (10 + 20)");
console.log("10 + 20 = "+ (10 + 20));
console.log('10 + 20 = ", (10 + 20)');
console.log('10 + 20 = '+ (10 + 20));
console.log("--------------------");
console.log(10+10); //เอามารวมกัน
console.log('10+'+'10'); //เอามาเชื่อมกัน
console.log('10+'+10);//เอามาเชื่อมกัน
console.log("--------------------");
console.log('10 + 20 = ${10 + 20}');
console.log("10 + 20 = ${10 + 20}"); 
console.log(`10 + 20 = ${10 + 20}`); // แนะนำให้ใช้งาน การใช้งาน ${} ในการแสดงผลข้อมูล 
console.log("--------------------");

// comment
// คอมเม้นต์ คือ การเขียนข้อความเพื่ออธิบายโค้ด หรือ การทำงานของโค้ด แบบบรรทัดเดียว
/*
คอมเม้นต์ คือ การเขียนข้อความเพื่ออธิบายโค้ด หรือ การทำงานของโค้ด
แบบหลายบรรทัด
*/

